n5/src/Catalogs/Addresses/Addresses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Addresses</name>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Banks</owners>
  <owners>Catalog.Individuals</owners>
  <owners>Catalog.Contacts</owners>
  <attributes>
    <name>Address</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Apartment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Building</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>CatalogRef.Cities</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>Entrance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Floor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Municipality</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>CatalogRef.States</types>
    </type>
  </attributes>
  <attributes>
    <name>Street</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZIPFormat</name>
    <type>
      <types>EnumRef.ZIP</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Addresses/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
		Forms.ActivateEmpty ( ThisObject, "Country, State, Municipality, City, Street" );
	endif;
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	UseAI = Application.AI ();
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Owner lock filled ( Object.Owner );
	|Address lock not Object.Manual;
	|Description show UseAI;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif;
	ContactsForm.SetCountry ( Object );
	ContactsForm.SetZIPFormat ( Object );
	
EndProcedure

&AtClient
Procedure OnOpen ( Cancel )
	
	ContactsForm.ZIPMask ( ThisObject );
	showGoogleMap ();
	
EndProcedure

&AtClient
Procedure showGoogleMap ()
	
	GoogleMap = GoogleMaps.ByAddress ( Object.Address );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure DescriptionOnChange ( Item )

	if ( UseAI and not IsBlankString ( Object.Description ) ) then
		WaitForm.Open ( "startFilling", , ThisObject );
	endif;

EndProcedure

&AtClient
Procedure startFilling ( Params, Value ) export
	
	fill ();
	WaitForm.Close ();
	
EndProcedure

&AtServer
Procedure fill ()
	
	owner = Object.Owner;
	type = TypeOf ( owner );
	if ( type = Type ( "CatalogRef.Organizations" ) ) then
		alient = DF.Pick ( owner, "Alien" );
	elsif ( type = Type ( "CatalogRef.Contacts" ) ) then
		alient = DF.Pick ( owner, "Owner.Alien" );
	else
		alient = false;
	endif;
	address = DataProcessors.AddressInfo.Get ( Object.Description, alient );
	FillPropertyValues ( Object, address, , "Owner, Code" );

EndProcedure

&AtClient
Procedure RefreshMap ( Command )
	
	GoogleMaps.SetAddress ( ThisObject, Items.GoogleMap, Object.Address );
	
EndProcedure

&AtClient
Procedure UpdateMap () export
	
	showGoogleMap ();
	
EndProcedure 

&AtClient
Procedure CountryOnChange ( Item )
	
	ContactsForm.SetZIPFormat ( Object );
	ContactsForm.ZIPMask ( ThisObject );
	ContactsForm.SetAddress ( Object );
	showGoogleMap ();
	setDescription ();
	
EndProcedure

&AtClient
Procedure AddressOnChange ( Item )
	
	ContactsForm.SetAddress ( Object );
	setDescription ();
	showGoogleMap ();

EndProcedure

&AtClient
Procedure setDescription ()
	
	Object.Description = StrReplace ( Object.Address, Chars.LF, ", " );
	
EndProcedure 

&AtClient
Procedure ZIPFormatOnChange ( Item )
	
	ContactsForm.ZIPMask ( ThisObject );
	ContactsForm.SetAddress ( Object );
	showGoogleMap ();
	setDescription ();
	
EndProcedure

&AtClient
Procedure ManualOnChange ( Item )
	
	if ( Object.Manual ) then
		activatePresentation ();
	else
		ContactsForm.SetAddress ( Object );
		setDescription ();
	endif; 
	Appearance.Apply ( ThisObject, "Object.Manual" );
	
EndProcedure

&AtClient
Procedure activatePresentation ()
	
	CurrentItem = Items.Address;
	
EndProcedure 

&AtClient
Procedure PresentationOnChange ( Item )
	
	setDescription ();
	
EndProcedure
